///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2024, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТекущееЗначение = Неопределено;

	Параметры.Свойство("ТекущееЗначение", ТекущееЗначение);

	Если ТекущееЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// BSLLS:UnusedLocalVariable-off
	Идентификатор = Строка(ТекущееЗначение);
	// BSLLS:UnusedLocalVariable-on

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИдентификатор(Команда)

	Закрыть(Новый УникальныйИдентификатор(Идентификатор));

КонецПроцедуры

#КонецОбласти