///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьВерсиюОбработки();

КонецПроцедуры

#КонецОбласти

 #Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЛицензияСсылкаНажатие(Элемент)

	ПерейтиПоНавигационнойСсылке(Элементы.ЛицензияСсылка.Заголовок);

КонецПроцедуры

&НаКлиенте
Процедура РепозиторийСсылкаНажатие(Элемент)

	ПерейтиПоНавигационнойСсылке(Элементы.РепозиторийСсылка.Заголовок);

КонецПроцедуры

&НаКлиенте
Процедура БиблиотекаСсылкаНажатие(Элемент)

	ПерейтиПоНавигационнойСсылке(Элементы.БиблиотекаСсылка.Заголовок);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВерсиюОбработки()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ВерсияОбработки = ОбработкаОбъект.ВерсияОбработки();

	Элементы.ВерсияПрограммы.Заголовок = СтрШаблон(
		НСтр("ru = 'Версия: %1'"),
		ВерсияОбработки);

КонецПроцедуры

#КонецОбласти