///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2024, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ОтображатьСиноним", ОтображатьСиноним);
	Параметры.Свойство("ОтображатьСтруктуруСУБД", ОтображатьСтруктуруСУБД);
	Параметры.Свойство("ОткрытиеИзФормыОбъекта", ОткрытиеИзФормыОбъекта);

	Если Не ОткрытиеИзФормыОбъекта Тогда
		Параметры.Свойство("ЗаписьВРежимеОбмена", ЗаписьВРежимеОбмена);
		Параметры.Свойство("КоличествоОтображаемыхРеквизитов", КоличествоОтображаемыхРеквизитов);
	КонецЕсли;

	УстановитьВидимостьДоступность();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)

	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("ОтображатьСиноним", ОтображатьСиноним);
	ПараметрыОповещения.Вставить("ОтображатьСтруктуруСУБД", ОтображатьСтруктуруСУБД);

	Если Не ОткрытиеИзФормыОбъекта Тогда
		ПараметрыОповещения.Вставить("ЗаписьВРежимеОбмена", ЗаписьВРежимеОбмена);
		ПараметрыОповещения.Вставить("КоличествоОтображаемыхРеквизитов", КоличествоОтображаемыхРеквизитов);
	КонецЕсли;

	Оповестить("РедакторДанных_ИзменениеНастроек", ПараметрыОповещения, ЭтотОбъект);

	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()

	Элементы.ЗаписьВРежимеОбмена.Видимость = Не ОткрытиеИзФормыОбъекта;
	Элементы.КоличествоОтображаемыхРеквизитов.Видимость = Не ОткрытиеИзФормыОбъекта;

КонецПроцедуры

#КонецОбласти